#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shuuren/shuuren-alpha/runs/run-NgQZZvamZ1qLDoBs

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.shuuren_cert: Refreshing state... [id=arn:aws:acm:us-east-1:265390238424:certificate/adf4603e-1f50-4653-b239-ade0bcb8362d]
aws_api_gateway_rest_api.shuuren_api_gateway_rest_api: Refreshing state... [id=kvf6m5r20e]
aws_cognito_user_pool.shuuren_user_pool: Refreshing state... [id=us-east-1_DBRCwS14a]
aws_api_gateway_resource.shuuren_api_user: Refreshing state... [id=pbfffe]
aws_api_gateway_rest_api_policy.shuuren_api_policy: Refreshing state... [id=kvf6m5r20e]
aws_cognito_user_pool_client.shuuren_client: Refreshing state... [id=2bcdpkh65mejtouigo9ltshc2q]
aws_api_gateway_method.shuuren_api_user_get: Refreshing state... [id=agm-kvf6m5r20e-pbfffe-GET]
aws_acm_certificate_validation.shuuren_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_api_gateway_integration.shuuren_api_user_get_integration: Refreshing state... [id=agi-kvf6m5r20e-pbfffe-GET]
aws_api_gateway_deployment.shuuren_api_deployment: Refreshing state... [id=habru0]
aws_api_gateway_stage.shuuren_api_stage: Refreshing state... [id=ags-kvf6m5r20e-api]
aws_api_gateway_domain_name.shuuren_api_gateway_custom_domain: Refreshing state... [id=api.shuuren.com]
aws_api_gateway_base_path_mapping.shuuren_api_mapping: Refreshing state... [id=api.shuuren.com/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cognito_user_pool_domain.shuuren_auth_domain will be created
  + resource "aws_cognito_user_pool_domain" "shuuren_auth_domain" {
      + aws_account_id              = (known after apply)
      + certificate_arn             = "arn:aws:acm:us-east-1:265390238424:certificate/adf4603e-1f50-4653-b239-ade0bcb8362d"
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "auth.shuuren.com"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = "us-east-1_DBRCwS14a"
      + version                     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pushed by: @rise-sudo, Action: `pull_request`*